Repository: danmigwi24/MY_TEMPLATES_SWIFT_UIKIT
Catalog: TEMPLATE_4/mobile-banking-ios/mobilebanking/resources/*.lproj/Localizable.strings
Languages: fr, pt_pt

# GLOBAL.CONTINUE
source: CONTINUE
fr: CONTINUER

# GLOBAL.NOTNOW
source: NOT NOW
fr: PAS MAINTENANT

# LocalizeSwiftUIView.welcome_message
source: Welcome to our app!
fr: Bienvenue dans notre application !
pt_pt: Bem-vindo ao nosso aplicativo!

# welcome_message
source: Welcome to our app!
fr: Bienvenue dans notre application !
pt_pt: Bem-vindo ao nosso aplicativo!

# introduction-string %@
source: Welcome to our app! %@
fr: Bienvenue dans notre application ! %@
pt_pt: Bem-vindo ao nosso aplicativo! %@

# GetStartedLandingPageScreen.title
source: Welcome to Eclectics Mobile Banking! Stay cashless & transact easily
fr: Bienvenue sur Eclectics Mobile Banking ! Restez sans argent liquide et effectuez des transactions facilement
pt_pt: Bem-vindo ao Eclectics Mobile Banking! Fique sem dinheiro vivo e faça transações facilmente

# GetStartedLandingPageScreen.getstarted
source: Get Started
fr: Commencer
pt_pt: Começar

# GetStartedLandingPageScreen.login
source: Login
fr: Se connecter
pt_pt: Conecte-se

# GetStartedLandingPageScreen.our_product
source: Our Product
fr: Notre Produit
pt_pt: Nosso Produto

# GetStartedLandingPageScreen.forex
source: Forex $ Stock
fr: Forex et Actions

# GetStartedLandingPageScreen.support
source: Support
fr: Soutien
pt_pt: Suporte

# GetStartedLandingPageScreen.open_account
source: Open Account
fr: Ouvrir un Compte
pt_pt: Abrir Conta

# GetStartedLandingPageScreen.about_us
source: About Us
fr: À Propos de Nous
pt_pt: Sobre Nós

# GetStartedLandingPageScreen.calculator
source: Calculator
fr: Calculatrice
pt_pt: Calculadora

# WelcomeAccountSelectionScreen.title
source: Hello there, welcome to Eclectics Bank we are happy to have you Here
fr: Bonjour, bienvenue chez Eclectics Bank, nous sommes heureux de vous accueillir ici
pt_pt: Olá, bem-vindo ao Eclectics Bank, estamos felizes em tê-lo aqui

# WelcomeAccountSelectionScreen.description
source: Select one of the options that best describes Your needs
fr: Sélectionnez l'une des options qui décrit le mieux vos besoins
pt_pt: Selecione uma das opções que melhor descreve suas necessidades

# WelcomeAccountSelectionScreen.have_account
source: I Have An Eclectics Account
fr: J'ai un compte Eclectics
pt_pt: Eu tenho uma conta Eclectics

# WelcomeAccountSelectionScreen.new_account
source: Iâ€™m New To Eclectics
fr: Je suis nouveau chez Eclectics
pt_pt: Sou novo no Eclectics

# Step1CreatePanicPinScreen.header
source: Create panic pin
fr: Créer un code de panique
pt_pt: Criar PIN de pânico

# Step1CreatePanicPinScreen.title
source: We want to make sure you are safe At all times
fr: Nous voulons nous assurer que vous êtes en sécurité à tout moment
pt_pt: Queremos garantir que você esteja seguro o tempo todo

# Step1CreatePanicPinScreen.description
source: This pin allows you to login into an account with a Pre-set minimum balance of your choice just incase you are in a tough situation and your account is vulnerable to unwilling transaction that you have been subjected to perform without any choice
fr: Ce code vous permet de vous connecter à un compte avec un solde minimum prédéfini de votre choix au cas où vous seriez dans une situation difficile et que votre compte serait vulnérable à des transactions non désirées que vous auriez été contraint de réaliser sans choix
pt_pt: Este PIN permite que você faça login em uma conta com um saldo mínimo pré-definido de sua escolha, caso esteja em uma situação difícil e sua conta esteja vulnerável a transações indesejadas que você foi obrigado a realizar sem escolha

# Step1CreatePanicPinScreen.text1
source: Keeps your account safe incase of hijacking
fr: Protège votre compte en cas de piratage
pt_pt: Mantém sua conta segura em caso de sequestro

# Step1CreatePanicPinScreen.text2
source: It stops people from knowing your actual balance
fr: Empêche les personnes de connaître votre solde réel
pt_pt: Impede que as pessoas saibam seu saldo real

# Step1CreatePanicPinScreen.text3
source: Protects your primary actual balance from robbers
fr: Protège votre solde réel principal des voleurs
pt_pt: Protege seu saldo real primário de ladrões

# Step1CreatePanicPinScreen.setpanicpinbutton
source: SET PANIC PIN
fr: DÉFINIR UN CODE DE PANIQUE
pt_pt: DEFINIR PIN DE PÂNICO

# Step1CreatePanicPinScreen.notnowbutton
source: NOT NOW
fr: PAS MAINTENANT
pt_pt: AGORA NÃO

# Step2CreatePanicPinScreen.header
source: Create panic pin
fr: Créer un code de panique
pt_pt: Criar PIN de pânico

# Step2CreatePanicPinScreen.title
source: We want to make sure you are safe At all times
fr: Nous voulons nous assurer que vous êtes en sécurité à tout moment
pt_pt: Queremos garantir que você esteja seguro o tempo todo

# Step2CreatePanicPinScreen.description
source: This pin allows you to login into an account with a Pre-set minimum balance of your choice just incase you are in a tough situation and your account is vulnerable to unwilling transaction that you have been subjected to perform without any choice
fr: Ce code vous permet de vous connecter à un compte avec un solde minimum prédéfini de votre choix au cas où vous seriez dans une situation difficile et que votre compte serait vulnérable à des transactions non désirées que vous auriez été contraint de réaliser sans choix
pt_pt: Este PIN permite que você faça login em uma conta com um saldo mínimo pré-definido de sua escolha, caso esteja em uma situação difícil e sua conta esteja vulnerável a transações indesejadas que você foi obrigado a realizar sem escolha

# Step2CreatePanicPinScreen.text1
source: Set panic mode
fr: Activer le mode panique
pt_pt: Definir modo de pânico

# Step2CreatePanicPinScreen.text2
source: Kindly set the minimum amount to show
fr: Veuillez définir le montant minimum à afficher
pt_pt: Por favor, defina o valor mínimo a ser mostrado

# Step2CreatePanicPinScreen.amount_label
source: Set Maximum Amount
fr: Définir le montant maximum
pt_pt: Definir Valor Máximo

# Step2CreatePanicPinScreen.amount_hint
source: Eg. KES 100,000
fr: Par exemple : 100 000 KES
pt_pt: Por exemplo, KES 100.000

# MinimumDepositScreen.title
source: Welcome to Eclectic Mobile Banking, make A minimum deposit to your account
fr: Bienvenue sur Eclectic Mobile Banking, effectuez un dépôt minimum sur votre compte
pt_pt: Bem-vindo ao Eclectic Mobile Banking, faça um depósito mínimo em sua conta

# MinimumDepositScreen.description
source: Make a minimum deposit of KES 100.00 for your account to be able to make transactions within the account
fr: Effectuez un dépôt minimum de 100,00 KES sur votre compte pour pouvoir effectuer des transactions dans le compte
pt_pt: Faça um depósito mínimo de KES 100,00 para que sua conta possa fazer transações dentro da conta

# MinimumDepositScreen.how_much_deposit
source: How much would you like to deposit?
fr: Combien souhaitez-vous déposer ?
pt_pt: Quanto você gostaria de depositar?

# MinimumDepositScreen.MAKEDEPOSIT
source: MAKE DEPOSIT
fr: FAIRE UN DÉPÔT
pt_pt: FAZER DEPÓSITO
